1. Сформулируйте SQL запрос для создания таблицы book

In [ ]:
CREATE TABLE book(
    book_id INT PRIMARY KEY AUTO_INCREMENT, 
    title VARCHAR(50),
    author VARCHAR(30),
    price DECIMAL(8, 2),
    amount INT
);

2. Занесите новую строку в таблицу book (текстовые значения (тип VARCHAR) заключать либо в двойные, либо в одинарные кавычки):

3. Занесите три последние записи в таблицу book, первая запись уже добавлена на предыдущем шаге:

4. Вывести информацию о всех книгах, хранящихся на складе.

In [ ]:
SELECT * FROM book

5. Выбрать авторов, название книг и их цену из таблицы book.

In [ ]:
SELECT author, title, price FROM book

6. Выбрать названия книг и авторов из таблицы book, для поля title задать имя(псевдоним) Название, для поля author – Автор.

In [ ]:
SELECT title AS Название,
author AS Автор,
FROM book;

7. Для упаковки каждой книги требуется один лист бумаги, цена которого 1 рубль 65 копеек. Посчитать стоимость упаковки для каждой книги (сколько денег потребуется, чтобы упаковать все экземпляры книги). В запросе вывести название книги, ее количество и стоимость упаковки, последний столбец назвать pack

In [ ]:
SELECT title, amount, amount * 1.65 AS pack
FROM book;

8. В конце года цену всех книг на складе пересчитывают – снижают ее на 30%. Написать SQL запрос, который из таблицы book выбирает названия, авторов, количества и вычисляет новые цены книг. Столбец с новой ценой назвать new_price, цену округлить до 2-х знаков после запятой.

In [ ]:
SELECT title, author, amount, ROUND(price * 0.7, 2) AS new_price
FROM book;

9. При анализе продаж книг выяснилось, что наибольшей популярностью пользуются книги Михаила Булгакова, на втором месте книги Сергея Есенина. Исходя из этого решили поднять цену книг Булгакова на 10%, а цену книг Есенина - на 5%. Написать запрос, куда включить автора, название книги и новую цену, последний столбец назвать new_price. Значение округлить до двух знаков после запятой.

In [ ]:
SELECT author, title,
    ROUND(IF(author='Булгаков М.А.', price * 1.1, IF(author='Есенин С.А.', price * 1.05, price)), 2) AS new_price
FROM book;

10. Вывести автора, название и цены тех книг, количество которых меньше 10.

In [ ]:
SELECT author, title, price
FROM book
WHERE amount > 10;

11. Вывести название, автора, цену и количество всех книг, цена которых меньше 500 или больше 600, а стоимость всех экземпляров этих книг больше или равна 5000.

In [ ]:
SELECT title, author, price, amount
FROM book
WHERE (price < 500 OR price > 600) AND amount * price >= 5000;